paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	// Create groups for encoder support for the different screens
	lv_group_t* vfo_group = lv_group_create();
	lv_indev_set_group(encoder_indev_t, vfo_group);

	usb_button = lv_btn_create(bg_top, NULL);
	lv_obj_set_event_cb(usb_button, mode_button_eh);
	lv_obj_align(usb_button, NULL, LV_ALIGN_CENTER, 170, 10);
	lv_btn_set_checkable(usb_button, true);
	lv_obj_set_size(usb_button, 40, 20);
	lv_obj_t *label = lv_label_create(usb_button, NULL);
	lv_label_set_text(label, "Usb");
	lv_group_add_obj(vfo_group, usb_button);

	lsb_button = lv_btn_create(bg_top, NULL);
	lv_obj_set_event_cb(lsb_button, mode_button_eh);
	lv_obj_align(lsb_button, NULL, LV_ALIGN_CENTER, 120, 10);
	lv_btn_set_checkable(lsb_button, true);
	lv_btn_toggle(lsb_button);
	lv_obj_set_size(lsb_button, 40, 20);
	label = lv_label_create(lsb_button, NULL);
	lv_label_set_text(label, "Lsb");
	lv_group_add_obj(vfo_group, lsb_button);

	vfo1_button = lv_btn_create(bg_top, NULL);
	lv_obj_set_event_cb(vfo1_button, mode_button_vfo);
	lv_obj_align(vfo1_button, NULL, LV_ALIGN_CENTER, 65, 10);
	lv_btn_set_checkable(vfo1_button, true);
	lv_btn_toggle(vfo1_button);
	lv_obj_set_size(vfo1_button, 50, 20);
	label = lv_label_create(vfo1_button, NULL);
	lv_label_set_text(label, "Vfo 1");
	lv_group_add_obj(vfo_group, vfo1_button);
	
	vfo2_button = lv_btn_create(bg_top, NULL);
	lv_obj_set_event_cb(vfo2_button, mode_button_vfo);
	lv_obj_align(vfo2_button, NULL, LV_ALIGN_CENTER, 10, 10);
	lv_btn_set_checkable(vfo2_button, true);
	//lv_btn_toggle(vfo2_button);
	lv_obj_set_size(vfo2_button, 50, 20);
	label = lv_label_create(vfo2_button, NULL);
	lv_label_set_text(label, "Vfo 2");
	lv_group_add_obj(vfo_group, vfo2_button);

	lv_obj_t* save_button = lv_btn_create(bg_top, NULL);
	lv_obj_set_event_cb(save_button, event_button_save);
	lv_obj_align(save_button, NULL, LV_ALIGN_CENTER, -45, 10);
	lv_obj_set_size(save_button, 50, 20);
	label = lv_label_create(save_button, NULL);
	lv_label_set_text(label, "Save");
	lv_group_add_obj(vfo_group, save_button);

	static lv_style_t text_style;
	lv_style_init(&text_style);

	/*Set a background color and a radius*/
	lv_style_set_radius(&text_style, LV_STATE_DEFAULT, 5);
	lv_style_set_bg_opa(&text_style, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_style_set_bg_color(&text_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_value_align(&text_style, LV_STATE_DEFAULT, LV_ALIGN_CENTER);
	lv_style_set_text_font(&text_style, LV_STATE_DEFAULT, &FreeSansOblique);

	vfo_frequency = lv_label_create(bg_middle, NULL);
	lv_label_set_long_mode(vfo_frequency, LV_LABEL_LONG_CROP);
	lv_obj_add_style(vfo_frequency, LV_OBJ_PART_MAIN, &text_style);
	lv_obj_set_width(vfo_frequency, LV_HOR_RES - 20);
	lv_label_set_text(vfo_frequency, "");
	lv_obj_set_height(vfo_frequency, 40);
	lv_obj_align(vfo_frequency, NULL, LV_ALIGN_CENTER, -30, -65);
	lv_label_set_align(vfo_frequency, LV_LABEL_ALIGN_CENTER);

	vfo_unit = lv_label_create(bg_middle, NULL);
	lv_obj_add_style(vfo_unit, LV_OBJ_PART_MAIN, &text_style);
	lv_label_set_text(vfo_unit, "Mhz");
	lv_obj_set_height(vfo_unit, 40);
	lv_obj_align(vfo_unit, NULL, LV_ALIGN_CENTER, 110, -68);
	lv_label_set_align(vfo_unit, LV_LABEL_ALIGN_CENTER);

	label_wifi = lv_label_create(bg_top, NULL);
	lv_label_set_long_mode(label_wifi, LV_LABEL_LONG_SROLL_CIRC);
	lv_obj_set_width(label_wifi, LV_HOR_RES - 20);
	lv_label_set_text(label_wifi, LV_SYMBOL_WIFI);
	lv_obj_align(label_wifi, NULL, LV_ALIGN_IN_TOP_LEFT, 0, 5);
	lv_obj_set_hidden(label_wifi, true);

	char str[80];
	
	band_roller_str(str);
	Band_roller = lv_roller_create(bg_middle, NULL);
	lv_roller_set_options(Band_roller,str, LV_ROLLER_MODE_INFINITE);
	lv_obj_align(Band_roller,NULL, LV_ALIGN_CENTER, 120, 10);
	lv_obj_set_width(Band_roller, 80);
	lv_obj_set_event_cb(Band_roller, band_event_handler);
	lv_roller_set_visible_row_count(Band_roller, 2);
	lv_group_add_obj(vfo_group, Band_roller);


	Tx_led1 = lv_led_create(bg_middle, NULL);
	lv_obj_align(Tx_led1, NULL, LV_ALIGN_CENTER, -125, -50);
	lv_led_off(Tx_led1);
	lv_obj_set_size(Tx_led1, 20, 20);
	
	lv_obj_t* Tx_ledlabel = lv_label_create(bg_middle, NULL);
	lv_obj_align(Tx_ledlabel, Tx_led1, LV_ALIGN_OUT_TOP_MID, 7, 0);
	lv_label_set_text(Tx_ledlabel, "TX");

	bfo_spinbox = lv_spinbox_create(bg_middle, NULL);
	lv_spinbox_set_range(bfo_spinbox, 8900, 9900);
	lv_spinbox_set_digit_format(bfo_spinbox, 4, 0);
	lv_spinbox_step_prev(bfo_spinbox);
	lv_obj_set_width(bfo_spinbox, 60);
	lv_obj_align(bfo_spinbox, NULL, LV_ALIGN_CENTER, -80, -20);
	lv_textarea_set_cursor_hidden(bfo_spinbox, true);

	lv_coord_t h = lv_obj_get_height(bfo_spinbox);
	btn_plus = lv_btn_create(bg_middle, NULL);
	lv_obj_set_size(btn_plus, h, h);
	lv_obj_align(btn_plus, bfo_spinbox, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn_plus, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn_plus, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn_plus, lv_spinbox_increment_event_cb);
	lv_group_add_obj(vfo_group, btn_plus);
	
	// Keep de order of the focus correct
	lv_group_add_obj(vfo_group, bfo_spinbox);

	btn_min = lv_btn_create(bg_middle, btn_plus);
	lv_obj_align(btn_min, bfo_spinbox, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn_min, lv_spinbox_decrement_event_cb);
	lv_obj_set_style_local_value_str(btn_min, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);
	lv_group_add_obj(vfo_group, btn_min);

	static lv_color_t needle_colors[1];
	needle_colors[0] = LV_COLOR_ORANGE;
	
	static lv_style_t gauge_style;
	lv_style_init(&gauge_style);
	lv_style_set_bg_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_line_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_scale_end_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_RED);
	lv_style_set_text_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_border_side(&gauge_style, LV_STATE_DEFAULT, LV_BORDER_SIDE_NONE);
	lv_style_set_scale_end_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_scale_end_border_width(&gauge_style, LV_STATE_DEFAULT, 2);

	Swr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(Swr_gauge, NULL, LV_ALIGN_CENTER, 100, 45);
	lv_gauge_set_needle_count(Swr_gauge, 1, needle_colors);
	lv_obj_set_size(Swr_gauge, 150, 150);
	lv_gauge_set_range(Swr_gauge, 0, 10);
	int line_cnt, label_cnt = 5, sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(Swr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_critical_value(Swr_gauge, 4);
	lv_gauge_set_angle_offset(Swr_gauge,0);
	/*Allow recoloring of the images according to the needles' color*/
	lv_obj_set_style_local_image_recolor_opa(Swr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	
	lv_obj_t* swr_label = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_label, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(swr_label, "Swr");
	lv_obj_set_hidden(Swr_gauge, true);
	swr_vlabel = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_vlabel, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(swr_vlabel, "0.0");
	lv_obj_set_hidden(Swr_gauge, true);

	pwr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(pwr_gauge, NULL, LV_ALIGN_CENTER, -65, 45);
	lv_gauge_set_needle_count(pwr_gauge, 1, needle_colors);
	lv_obj_set_size(pwr_gauge, 150, 150);
	lv_gauge_set_range(pwr_gauge, 0, 10);
	label_cnt = 5; sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(pwr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_angle_offset(pwr_gauge, 0);
	/*Allow recoloring of the images according to the needles' color*/
	lv_obj_set_style_local_image_recolor_opa(pwr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_t* pwr_label = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_label, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(pwr_label, "Watt");
	pwr_vlabel = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_vlabel, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(pwr_vlabel, "0.0");
	lv_obj_set_hidden(pwr_gauge, true);

	gui_setup(scr);
	gui_si5351(scr);
	init_wifi_gui(scr);

