paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	long frq = get_vfo_frequency(active_vfo);
	setfrequencylabel(frq);
	xSemaphoreGive(GuiBinarySemaphore);
	int tt = 0;
	while (1) {
/*
* Call the lv_task_handler to process GUI changes
* Semaphores are there for thread save GUI changes from other threads
* lv_task_handler should not be executed if other tasks change the GUI
*/
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
		lv_task_handler();
		xSemaphoreGive(GuiBinarySemaphore);
		int count = Enc_vfo.getCount();
		if (count != 0)
		{
/*
* Translate the encoder movement to a new frequency
* If the band is changed also update the band roller
*/

			long frq = set_encoder_count_to_vfo_frequency(count, active_vfo);
			Enc_vfo.clearCount();
			setfrequencylabel(frq);
			uint16_t i = get_band();
			uint16_t ii = lv_roller_get_selected(Band_roller);
			if (i != ii)
				lv_roller_set_selected(Band_roller, i , LV_ANIM_ON);
		}
/*
* Process rotary press button messages
*/
		rotary_button.check();
		smeter->Draw(get_smeter());
		
		static volatile int lastPowerEncoding;
		static	bool	hide_rx = true;
		if (f_rxtx)
		{
			if (hide_rx == false)
			{
				hide_rx = true;
				lv_obj_set_hidden(btn_min, true);
				lv_obj_set_hidden(btn_plus, true);
				lv_obj_set_hidden(bfo_spinbox, true);
				lv_obj_set_hidden(Band_roller, true);				
				smeter->hide(true);
				lv_obj_set_hidden(Swr_gauge, false);
				lv_obj_set_hidden(pwr_gauge, false);
			}
			int currMillis = millis();
			if (currMillis - lastPowerEncoding > POLL_TIMER)
			{
				uint16_t swr, pep;

				pswr_sync_from_interrupt(); 
				calc_SWR_and_power();
				swr = print_swr();
				pep = power_mw_pep / 10000.0;//print_p_mw(power_mw_pep);
				lv_gauge_set_value(Swr_gauge, 0, swr/20);
				lv_gauge_set_value(pwr_gauge, 0, pep);
				lv_label_set_text(swr_vlabel, String((double)swr/20.0).c_str());
				lv_label_set_text(pwr_vlabel, String((double)power_mw_pep / 10000.0).c_str());
				Serial.println("SWR: " + String(swr) + "Power: " + String(pep));
				lastPowerEncoding = currMillis;
			}

		}
		else
		{
			if (hide_rx == true)
			{
				hide_rx = false;
				lv_obj_set_hidden(btn_min, false);
				lv_obj_set_hidden(btn_plus, false);
				lv_obj_set_hidden(bfo_spinbox, false);
				lv_obj_set_hidden(Band_roller, false);
				smeter->hide(false);
				lv_obj_set_hidden(Swr_gauge, true);
				lv_obj_set_hidden(pwr_gauge, true);
			}
		}
		vTaskDelay(5);
	}
}

static void rotary_button_eventhandler(AceButton*, uint8_t eventType, uint8_t buttonState)
{
	switch (eventType) {
	case AceButton::kEventLongPressed:
		ToggleSetup(true);
		break;
	case AceButton::kEventPressed:
		enc_button_state = LV_INDEV_STATE_PR;
		break;

	case AceButton::kEventReleased:
		enc_button_state = LV_INDEV_STATE_REL;
		break;
	}
}


// Callbacks

/* Display flushing */
void my_disp_flush(lv_disp_drv_t* disp, const lv_area_t* area, lv_color_t* color_p)
{
	uint16_t c;

	tft.startWrite(); /* Start new TFT transaction */
	tft.setAddrWindow(area->x1, area->y1, (area->x2 - area->x1 + 1), (area->y2 - area->y1 + 1)); /* set the working window */
	for (int y = area->y1; y <= area->y2; y++) {
		for (int x = area->x1; x <= area->x2; x++) {
			c = color_p->full;
			tft.writeColor(c, 1);
			color_p++;
		}
	}
	tft.endWrite(); /* terminate TFT transaction */
	lv_disp_flush_ready(disp); /* tell lvgl that flushing is done */
}

bool my_touchpad_read(lv_indev_drv_t* indev_driver, lv_indev_data_t* data)
{
	uint16_t touchX, touchY;

	bool touched = tft.getTouch(&touchX, &touchY, 600);

	if (tft.getRotation() == 1)
	{
		touchX = screenWidth - touchX;
	}

	if (!touched)
	{
		return false;
	}

	if (touchX > screenWidth || touchY > screenHeight)
	{
		Serial.println("Y or y outside of expected parameters..");
		Serial.print("y:");
		Serial.print(touchX);
		Serial.print(" x:");
		Serial.print(touchY);
	}
	else
	{

		data->state = touched ? LV_INDEV_STATE_PR : LV_INDEV_STATE_REL;

		/*Save the state and save the pressed coordinate*/
		//if(data->state == LV_INDEV_STATE_PR) touchpad_get_xy(&last_x, &last_y);

		/*Set the coordinates (if released use the last pressed coordinates)*/
		data->point.x = touchX;
		data->point.y = touchY;

		Serial.print("Data x");
		Serial.println(touchX);

		Serial.print("Data y");
		Serial.println(touchY);

	}

	return false; /*Return `false` because we are not buffering and no more data to read*/
}

static void mode_button_eh(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		//printf("Clicked\n");
	}
	else if (event == LV_EVENT_VALUE_CHANGED) {
		if (obj == usb_button)
		{
			lv_btn_toggle(lsb_button);
			switch_mode(MODE_USB, active_vfo);
		}
		if (obj == lsb_button)
		{
			lv_btn_toggle(usb_button);
			switch_mode(MODE_LSB, active_vfo);
		}
	}
}

static void mode_button_vfo(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_CLICKED) {
		//printf("Clicked\n");
	}
	else if (event == LV_EVENT_VALUE_CHANGED) {
		if (obj == vfo1_button)
		{
			lv_btn_toggle(vfo2_button);
			active_vfo = 0;
		}
		if (obj == vfo2_button)
		{
			lv_btn_toggle(vfo1_button);
			active_vfo = 1;
		}
		long frq = switch_vfo(active_vfo);
		setfrequencylabel(frq);
		
	}
}

void updateBottomStatus(lv_color_t color, String text, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_style_local_bg_color(bg_bottom, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, color);
	lv_label_set_text(label_status, text.c_str());
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void showWifilabel(bool show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_hidden(label_wifi, show);
	xSemaphoreGive(GuiBinarySemaphore);
}


// this function is used to set the display frequency, it is not using semaphore because this is done from main loop
void setfrequencylabel(long freq, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[80];

	sprintf(str, "%3d.%03d,%02d", freq / 1000000, (freq / 1000) % 1000, (freq / 10) % 100);
	lv_label_set_text(vfo_frequency, str);
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

static void band_event_handler(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_VALUE_CHANGED) {
		char	buf[80];
		long	frq;

		lv_roller_get_selected_str(obj, buf, sizeof(buf));
		buf[2] = '\0';
		frq = band_select(buf, active_vfo);
		setfrequencylabel(frq);
		set_vfo_frequency(frq, active_vfo);
	}
}

void ToggleTX(uint8_t show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
		lv_led_on(Tx_led1);
	else
		lv_led_off(Tx_led1);
	xSemaphoreGive(GuiBinarySemaphore);
}


static void lv_spinbox_increment_event_cb(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(bfo_spinbox);
		lv_textarea_set_cursor_hidden(bfo_spinbox, false);
	}
}

static void lv_spinbox_decrement_event_cb(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(bfo_spinbox);
		lv_textarea_set_cursor_hidden(bfo_spinbox, false);
	}
}

static void event_button_save(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		SaveEEPROM();
	}
}

