paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
void ToggleSetup(bool show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
		lv_obj_move_foreground(bg_middle2);
	else
		lv_obj_move_background(bg_middle2);
	xSemaphoreGive(GuiBinarySemaphore);
}

void BfoLabel(uint32_t num, uint8_t sem) {
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_spinbox_set_value(bfo_spinbox, num);
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

void Togglemode(int mode, uint8_t sem)
{
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY); 
	if (mode == MODE_LSB)
	{
		lv_btn_set_state(lsb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(usb_button, LV_BTN_STATE_RELEASED);
	}
	if (mode == MODE_USB)
	{
		lv_btn_set_state(usb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(lsb_button, LV_BTN_STATE_RELEASED);
	}
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

static void gui_setup_event_handler(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_VALUE_CHANGED) {
		uint16_t abutton = lv_btnmatrix_get_active_btn(obj);
		switch (abutton)
		{
		case 0:
			show_wifi_gui(true);
			break;
		case 1:
			//Si5351 calibration
			lv_obj_move_foreground(bg_middle3);
			start_cal();
			break;
		case 2:
			
			break;
		case 3:
			memset(&R, 0, sizeof(R));
			init_vfo();
			SaveEEPROM();
			ESP.restart();
			break;
		}
		
	}
}

static void gui_setup(lv_obj_t *scr)
{
	static const char* setup_btnm_map[] = { "Wifi", "Si5351", "Calibrate\n AD8307", "Reset", "" };

	bg_middle2 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle2, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle2, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle2, 0, topHeight);
	lv_obj_set_size(bg_middle2, LV_HOR_RES, screenHeight - topHeight - bottomHeight);
	lv_obj_move_background(bg_middle2);

	lv_obj_t* btnm1 = lv_btnmatrix_create(bg_middle2, NULL);
	lv_btnmatrix_set_map(btnm1, setup_btnm_map);
	lv_obj_align(btnm1, NULL, LV_ALIGN_CENTER, 0, 0);
	lv_btnmatrix_set_btn_ctrl(btnm1, 6, LV_BTNMATRIX_CTRL_CHECKABLE);
	lv_obj_set_event_cb(btnm1, gui_setup_event_handler);

	lv_obj_t* pwd_label1 = lv_label_create(bg_middle2, NULL);
	lv_label_set_text(pwd_label1, "Setup");
	lv_obj_align(pwd_label1, btnm1, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

}

static void lv_spinbox_increment_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(si_spinbox);
		R.correction_si5351_no1 = lv_spinbox_get_value(si_spinbox);
		cal_vfo();
	}
}

static void lv_spinbox_decrement_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(si_spinbox);
		R.correction_si5351_no1 = lv_spinbox_get_value(si_spinbox);
		cal_vfo();
	}
}

static void lv_spinbox_increment_event_si2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_increment(si_spinbox2);
		R.correction_si5351_no2 = lv_spinbox_get_value(si_spinbox);
		cal_bfo();
	}
}

static void lv_spinbox_decrement_event_si2(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_spinbox_decrement(si_spinbox2);
		R.correction_si5351_no2 = lv_spinbox_get_value(si_spinbox);
		cal_bfo();
	}
}

static void lv_spinbox_save_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		SaveEEPROM();
		updateBottomStatus(LV_COLOR_GREEN, "Si5351 calibration saved", 0);
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
	}
}

static void lv_spinbox_cancel_event_si(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		lv_obj_move_foreground(bg_middle);
		lv_obj_move_background(bg_middle3);
	}
}

static void gui_si5351(lv_obj_t* scr)
{
	bg_middle3 = lv_obj_create(scr, NULL);
	lv_obj_clean_style_list(bg_middle3, LV_OBJ_PART_MAIN);
	lv_obj_set_style_local_bg_opa(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_set_style_local_bg_color(bg_middle3, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_obj_set_pos(bg_middle3, 0, topHeight);
	lv_obj_set_size(bg_middle3, LV_HOR_RES, screenHeight - topHeight - bottomHeight);
	lv_obj_move_background(bg_middle3);

	si_spinbox = lv_spinbox_create(bg_middle3, NULL);
	lv_spinbox_set_range(si_spinbox, -150000, 150000);
	lv_spinbox_set_digit_format(si_spinbox, 7, 0);
	lv_spinbox_step_prev(si_spinbox);
	lv_obj_set_width(si_spinbox, 120);
	lv_obj_align(si_spinbox, NULL, LV_ALIGN_CENTER, 0, -50);
	lv_spinbox_set_value(si_spinbox, 0);

	lv_obj_t* pwd_label1 = lv_label_create(bg_middle3, NULL);
	lv_label_set_text(pwd_label1, "Vfo Si5351");
	lv_obj_align(pwd_label1, si_spinbox, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

	lv_coord_t h = lv_obj_get_height(si_spinbox);
	lv_obj_t* btn = lv_btn_create(bg_middle3, NULL);
	lv_obj_set_size(btn, h, h);
	lv_obj_align(btn, si_spinbox, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn, lv_spinbox_increment_event_si);

	btn = lv_btn_create(bg_middle3, btn);
	lv_obj_align(btn, si_spinbox, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn, lv_spinbox_decrement_event_si);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);

	si_spinbox2 = lv_spinbox_create(bg_middle3, NULL);
	lv_spinbox_set_range(si_spinbox2, -150000, 150000);
	lv_spinbox_set_digit_format(si_spinbox2, 7, 0);
	lv_spinbox_step_prev(si_spinbox2);
	lv_obj_set_width(si_spinbox2, 120);
	lv_obj_align(si_spinbox2, NULL, LV_ALIGN_CENTER, 0, +20);
	lv_spinbox_set_value(si_spinbox2, 0);

	pwd_label1 = lv_label_create(bg_middle3, NULL);
	lv_label_set_text(pwd_label1, "Bfo Si5351");
	lv_obj_align(pwd_label1, si_spinbox2, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

	h = lv_obj_get_height(si_spinbox2);
	btn = lv_btn_create(bg_middle3, NULL);
	lv_obj_set_size(btn, h, h);
	lv_obj_align(btn, si_spinbox2, LV_ALIGN_OUT_RIGHT_MID, 5, 0);
	lv_theme_apply(btn, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_PLUS);
	lv_obj_set_event_cb(btn, lv_spinbox_increment_event_si2);

	btn = lv_btn_create(bg_middle3, btn);
	lv_obj_align(btn, si_spinbox2, LV_ALIGN_OUT_LEFT_MID, -5, 0);
	lv_obj_set_event_cb(btn, lv_spinbox_decrement_event_si2);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, LV_SYMBOL_MINUS);


	btn = lv_btn_create(bg_middle3, NULL);
	lv_obj_align(btn, NULL, LV_ALIGN_CENTER, -70, 70);
	lv_theme_apply(btn, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "Save");
	lv_obj_set_event_cb(btn, lv_spinbox_save_event_si);

	btn = lv_btn_create(bg_middle3, NULL);
	lv_obj_align(btn, NULL, LV_ALIGN_CENTER, 70, 70);
	lv_theme_apply(btn, LV_THEME_SPINBOX_BTN);
	lv_obj_set_style_local_value_str(btn, LV_BTN_PART_MAIN, LV_STATE_DEFAULT, "Cancel");
	lv_obj_set_event_cb(btn, lv_spinbox_cancel_event_si);
}